app/Models/Karyawan_model.php

SELECT *
FROM `data_karyawan`
---
    public function getKaryawan($id = false)
    {
        if ($id === false) {
            return $this->findAll();